The CIFAR-10 dataset consists of 60000 32x32 colour images in 10 classes, with 6000 images per class. There are 50000 training images and 10000 test images. 
The classes for database are: airplane, automobile, bird, cat, deer, dog, frog, horse, ship and truck.
To predict images, the classificator use a convolutional neural network with the accuracy and that have:
_________________________________________________________________
Layer (type)                 Output Shape            Param #   
===============================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)      896       
_______________________________________________________________
activation_1 (Activation)    (None, 32, 32, 32)      0         
_______________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 32)      128       
_______________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)      9248      
_______________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32)      0         
_______________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 32)      128       
_______________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 32)      0         
_______________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 32)      0         
_______________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 64)      18496     
_______________________________________________________________
activation_3 (Activation)    (None, 16, 16, 64)      0         
_______________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 64)      256       
_______________________________________________________________
conv2d_4 (Conv2D)            (None, 16, 16, 64)      36928     
_______________________________________________________________
activation_4 (Activation)    (None, 16, 16, 64)      0         
_______________________________________________________________
batch_normalization_4 (Batch (None, 16, 16, 64)      256       
_______________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 8, 8, 64)        0         
_______________________________________________________________
dropout_2 (Dropout)          (None, 8, 8, 64)        0         
_______________________________________________________________
conv2d_5 (Conv2D)            (None, 8, 8, 128)       73856     
_______________________________________________________________
activation_5 (Activation)    (None, 8, 8, 128)       0         
_______________________________________________________________
batch_normalization_5 (Batch (None, 8, 8, 128)       512       
_______________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 8, 128)       147584    
_______________________________________________________________
activation_6 (Activation)    (None, 8, 8, 128)       0         
_______________________________________________________________
batch_normalization_6 (Batch (None, 8, 8, 128)       512       
_______________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 128)       0         
_______________________________________________________________
dropout_3 (Dropout)          (None, 4, 4, 128)       0         
_______________________________________________________________
flatten_1 (Flatten)          (None, 2048)            0         
_______________________________________________________________
dense_1 (Dense)              (None, 128)             262272    
_______________________________________________________________
dropout_4 (Dropout)          (None, 128)             0         
_______________________________________________________________
dense_2 (Dense)              (None, 10)              1290      
===============================================================
Total params: 552,362
Trainable params: 551,466
Non-trainable params: 896